results/cpu-vs-latency2/redis/3-3/nsl207.out
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  30 secs]  0 threads:      642158 ops,   21233 (avg:   21405) ops/sec, 806.97KB/sec (avg: 813.43KB/sec),  0.18 (avg:  0.18) msec latency

1         Threads
4         Connections per thread
30        Seconds
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets        1945.99          ---          ---      0.18400       149.91
Gets       19459.21        13.37     19445.85      0.18200       663.52
Totals     21405.21        13.37     19445.85      0.18200       813.43


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET        -nan    100.00000
---
GET       0.061      0.00017
GET       0.076      0.00034
GET       0.079      0.00069
GET       0.080      0.00086
GET       0.081      0.00103
GET       0.083      0.00120
GET       0.084      0.00188
GET       0.085      0.00206
GET       0.086      0.00291
GET       0.087      0.00411
GET       0.088      0.00565
GET       0.089      0.00582
GET       0.090      0.00702
GET       0.091      0.01011
GET       0.092      0.01165
GET       0.093      0.01525
GET       0.094      0.01833
GET       0.095      0.02295
GET       0.096      0.02587
GET       0.097      0.02929
GET       0.098      0.03340
GET       0.099      0.03820
GET       0.100      0.07383
GET       0.110      0.17678
GET       0.120      0.34756
GET       0.130      0.75148
GET       0.140      2.82025
GET       0.150      8.04570
GET       0.160     17.73637
GET       0.170     31.93646
GET       0.180     51.35497
GET       0.190     74.86647
GET       0.200     89.69249
GET       0.210     95.91506
GET       0.220     98.15666
GET       0.230     99.04690
GET       0.240     99.43317
GET       0.250     99.59128
GET       0.260     99.66289
GET       0.270     99.69235
GET       0.280     99.71222
GET       0.290     99.72695
GET       0.300     99.74322
GET       0.310     99.76190
GET       0.320     99.77988
GET       0.330     99.80095
GET       0.340     99.81620
GET       0.350     99.84086
GET       0.360     99.86467
GET       0.370     99.88951
GET       0.380     99.91624
GET       0.390     99.93919
GET       0.400     99.96094
GET       0.410     99.97465
GET       0.420     99.98407
GET       0.430     99.99178
GET       0.440     99.99418
GET       0.450     99.99675
GET       0.460     99.99794
GET       0.470     99.99846
GET       0.480     99.99863
GET       0.490     99.99880
GET       0.500     99.99897
GET       0.510     99.99914
GET       0.520     99.99931
GET       0.540     99.99949
GET       0.570    100.00000